#+Include: ../../doc.templates/title-injects.org
#+Include: ../../preamble.org

** DONE Tasks for Lab results overdue 

#+name: tasklaboverdue  
#+begin_src R :exports both :dir ../../doc.generation/mustache :results value org drawer :cache no :var iduser=usercode day=43
library(whisker)
cs <- read.csv2("../../data.out/ft_tasks.csv", sep=";", header=TRUE, skip=0, 
  na.strings=c("","nil"), stringsAsFactors=FALSE)
cs <- cs[order(cs$IdCase, cs$LastName), ]
cs <- cs[cs$TaskStatus=="overdue",]
cs <- cs[cs$TaskType=="lab",]

cs <- cs[cs$IdUser==iduser,]
cs <- cs[cs$Day==day,]

count <- nrow(cs)

countQ <- as.logical(count>0)
countManyQ <- as.logical(count>1)
out <- data.frame(count,countQ,countManyQ)
names(out) <- c("TaskNumber","TaskQ","TasksManyQ")

task <- unname(rowSplit(out))
f <- "task-laboverdue.org"
contents <- readChar(f, file.info(f)$size)

text <- whisker.render(contents)
text <- gsub("[\r]", "", text)
text
#+end_src

#+RESULTS: tasklaboverdue
:RESULTS:

 /There should be at least 9 lab requests overdue./ 

:END:

** DONE Labinfo

#+name: labinfo  
#+begin_src R :exports both :dir ../../doc.generation/mustache :results value org drawer :cache no :var iduser=usercode day=16
library(whisker)
cs <- read.csv2("../../data.out/ft_labinfo.csv", sep=";", header=TRUE, skip=0, 
  na.strings=c("","nil"), stringsAsFactors=FALSE)
cs <- cs[order(cs$IdCase, cs$LastName), ]

cs <- cs[cs$IdUser==iduser,]
cs <- cs[cs$Day==day,]

lab <- unname(rowSplit(cs))

f <- "labinfo.org"
contents <- readChar(f, file.info(f)$size)

text <- whisker.render(contents)
text <- gsub("[\r]", "", text)
text
#+end_src

#+RESULTS: labinfo
:RESULTS:

   /Lab info[fn:: Case -- 2]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------|
   | Name                      | Sesugh Ogunode                    |
   | Sex \ldots Age \ldots DoB | male \ldots 17 \ldots 1998-05-03 |
   |---------------------------+-----------------------------------------------|
   | Sample-Date               | 2015-06-15                                |
   | Sample-Id                 | 641944                                  |
   | Sample-Specimen           | Stool                            |
   | Date of Diagnosis         | 2015-06-16                             |
   | Pathogene                 | Exercise disease virus                              |
   | Method                    | PCR                                 |
   | Result                    | negative                                 |
   |---------------------------+-----------------------------------------------|
   
   #+Latex: \medskip
   /Lab info[fn:: Case -- 122]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------|
   | Name                      | Chicobe Adebowale                    |
   | Sex \ldots Age \ldots DoB | female \ldots 30 \ldots 1984-10-26 |
   |---------------------------+-----------------------------------------------|
   | Sample-Date               | 2015-06-15                                |
   | Sample-Id                 | 455531                                  |
   | Sample-Specimen           | Stool                            |
   | Date of Diagnosis         | 2015-06-16                             |
   | Pathogene                 | Exercise disease virus                              |
   | Method                    | PCR                                 |
   | Result                    | negative                                 |
   |---------------------------+-----------------------------------------------|
   
   #+Latex: \medskip
   /Lab info[fn:: Case -- 537]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------|
   | Name                      | Efemena Ekpuk                    |
   | Sex \ldots Age \ldots DoB | female \ldots 17 \ldots 1997-06-28 |
   |---------------------------+-----------------------------------------------|
   | Sample-Date               | 2015-06-15                                |
   | Sample-Id                 | 856525                                  |
   | Sample-Specimen           | Blood                            |
   | Date of Diagnosis         | 2015-06-16                             |
   | Pathogene                 | Exercise disease virus                              |
   | Method                    | PCR                                 |
   | Result                    | negative                                 |
   |---------------------------+-----------------------------------------------|
   
   #+Latex: \medskip
   /Lab info[fn:: Case -- 662]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------|
   | Name                      | Chidinma Offiah                    |
   | Sex \ldots Age \ldots DoB | female \ldots 35 \ldots 1979-06-30 |
   |---------------------------+-----------------------------------------------|
   | Sample-Date               | 2015-06-16                                |
   | Sample-Id                 | 154279                                  |
   | Sample-Specimen           | Stool                            |
   | Date of Diagnosis         | 2015-06-16                             |
   | Pathogene                 | Exercise disease virus                              |
   | Method                    | PCR                                 |
   | Result                    | positive                                 |
   |---------------------------+-----------------------------------------------|
   
   #+Latex: \medskip
   /Lab info[fn:: Case -- 1117]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------|
   | Name                      | Monijesu Brigidi                    |
   | Sex \ldots Age \ldots DoB | female \ldots 48 \ldots 1966-11-18 |
   |---------------------------+-----------------------------------------------|
   | Sample-Date               | 2015-06-16                                |
   | Sample-Id                 | 455861                                  |
   | Sample-Specimen           | Blood                            |
   | Date of Diagnosis         | 2015-06-16                             |
   | Pathogene                 | Exercise disease virus                              |
   | Method                    | PCR                                 |
   | Result                    | negative                                 |
   |---------------------------+-----------------------------------------------|
   
   #+Latex: \medskip
   /Lab info[fn:: Case -- 1333]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------|
   | Name                      | Olatunbosun Eguavoen                    |
   | Sex \ldots Age \ldots DoB | male \ldots 47 \ldots 1967-08-16 |
   |---------------------------+-----------------------------------------------|
   | Sample-Date               | 2015-06-15                                |
   | Sample-Id                 | 353110                                  |
   | Sample-Specimen           | Blood                            |
   | Date of Diagnosis         | 2015-06-16                             |
   | Pathogene                 | Exercise disease virus                              |
   | Method                    | PCR                                 |
   | Result                    | negative                                 |
   |---------------------------+-----------------------------------------------|
   
   #+Latex: \medskip
   /Lab info[fn:: Case -- 1376]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------|
   | Name                      | Nnaemeka Uche                    |
   | Sex \ldots Age \ldots DoB | male \ldots 16 \ldots 1999-11-01 |
   |---------------------------+-----------------------------------------------|
   | Sample-Date               | 2015-06-16                                |
   | Sample-Id                 | 981983                                  |
   | Sample-Specimen           | Blood                            |
   | Date of Diagnosis         | 2015-06-16                             |
   | Pathogene                 | Exercise disease virus                              |
   | Method                    | PCR                                 |
   | Result                    | negative                                 |
   |---------------------------+-----------------------------------------------|
   
   #+Latex: \medskip
   /Lab info[fn:: Case -- 1383]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------|
   | Name                      | Lola Adokwe                    |
   | Sex \ldots Age \ldots DoB | female \ldots 21 \ldots 1993-05-08 |
   |---------------------------+-----------------------------------------------|
   | Sample-Date               | 2015-06-15                                |
   | Sample-Id                 | 381128                                  |
   | Sample-Specimen           | Stool                            |
   | Date of Diagnosis         | 2015-06-16                             |
   | Pathogene                 | Exercise disease virus                              |
   | Method                    | PCR                                 |
   | Result                    | positive                                 |
   |---------------------------+-----------------------------------------------|
   
   #+Latex: \medskip
   /Lab info[fn:: Case -- 1463]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------|
   | Name                      | Ikeoluwatomiwaopayemi Jibowu                    |
   | Sex \ldots Age \ldots DoB | female \ldots 23 \ldots 1992-07-04 |
   |---------------------------+-----------------------------------------------|
   | Sample-Date               | 2015-06-16                                |
   | Sample-Id                 | 342640                                  |
   | Sample-Specimen           | Stool                            |
   | Date of Diagnosis         | 2015-06-16                             |
   | Pathogene                 | Exercise disease virus                              |
   | Method                    | PCR                                 |
   | Result                    | inconclusive                                 |
   |---------------------------+-----------------------------------------------|
   
   #+Latex: \medskip
   /Lab info[fn:: Case -- 1489]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------|
   | Name                      | Ayorogbami Latifu                    |
   | Sex \ldots Age \ldots DoB | male \ldots 33 \ldots 1981-01-12 |
   |---------------------------+-----------------------------------------------|
   | Sample-Date               | 2015-06-15                                |
   | Sample-Id                 | 159953                                  |
   | Sample-Specimen           | Blood                            |
   | Date of Diagnosis         | 2015-06-16                             |
   | Pathogene                 | Exercise disease virus                              |
   | Method                    | PCR                                 |
   | Result                    | negative                                 |
   |---------------------------+-----------------------------------------------|
   
   #+Latex: \medskip
   /Lab info[fn:: Case -- 1624]/

   #+Attr_Latex: :center nil :booktabs t
   |---------------------------+-----------------------------------------------|
   | Name                      | Bukola Mamudu                    |
   | Sex \ldots Age \ldots DoB | female \ldots 58 \ldots 1956-08-11 |
   |---------------------------+-----------------------------------------------|
   | Sample-Date               | 2015-06-15                                |
   | Sample-Id                 | 896374                                  |
   | Sample-Specimen           | Blood                            |
   | Date of Diagnosis         | 2015-06-16                             |
   | Pathogene                 | Exercise disease virus                              |
   | Method                    | PCR                                 |
   | Result                    | negative                                 |
   |---------------------------+-----------------------------------------------|
   
   #+Latex: \medskip


:END:

** DONE Cases to discharge

#+name: casedischarge  
#+begin_src R :exports both :dir ../../doc.generation/mustache :results value org drawer :cache no :var iduser=usercode day=22
library(whisker)
cs <- read.csv2("../../data.out/ft_tasks.csv", sep=";", header=TRUE, skip=0, 
 na.strings=c("","nil"), stringsAsFactors=FALSE)
cs <- cs[order(cs$IdCase, cs$LastName), ]
cs <- cs[cs$TaskStatus=="open",]
cs <- cs[cs$TaskType=="discharge",]

cs <- cs[cs$IdUser==iduser,]
cs <- cs[cs$Day==day,]

discharge <- unname(rowSplit(cs))

f <- "discharge.org"
contents <- readChar(f, file.info(f)$size)

text <- whisker.render(contents)
text <- gsub("[\r]", "", text)
text
#+end_src

#+RESULTS: casedischarge
:RESULTS:

#+Attr_Latex: :center nil :booktabs t
   |-------------------------------------------+---------+---------+-----------------|
   | Case                                      | Sex     | Age     | DoB             |
   |-------------------------------------------+---------+---------+-----------------|
   |  Efemena Ekpuk | female | 17 | 1997-06-28 |
   | Nnaemeka Uche | male | 16 | 1999-11-01 |
   |-----
 
   \medskip

:END:

** DONE Tasks for Cases that died

#+name: casedied  
#+begin_src R :exports both :dir ../../doc.generation/mustache :results value org drawer :cache no :var iduser=usercode day=22
library(whisker)
cs <- read.csv2("../../data.out/ft_tasks.csv", sep=";", header=TRUE, skip=0, 
  na.strings=c("","nil"), stringsAsFactors=FALSE)
cs <- cs[order(cs$IdCase, cs$LastName), ]
cs <- cs[cs$TaskStatus=="open",]
cs <- cs[cs$TaskType=="burial",]

cs <- cs[cs$IdUser==iduser,]
cs <- cs[cs$Day==day,]

burial <- unname(rowSplit(cs))

f <- "burial.org"
contents <- readChar(f, file.info(f)$size)

text <- whisker.render(contents)
text <- gsub("[\r]", "", text)
text
#+end_src

#+RESULTS: casedied
:RESULTS:

#+Attr_Latex: :center nil :booktabs t
   |----------------------------------------+---------+---------+-----------------+-----------------|
   | Case                                   | Sex     | Age     | DoB             | DateOfDeath     |
   |----------------------------------------+---------+---------+-----------------+-----------------|
   |  Nonso Fabunmi | male | 16 | 1998-08-14 | 2015-06-22 |
   | Obioma Igiebor | female | 24 | 1990-08-23 | 2015-06-22 |
   | Tolani Kyari | female | 39 | 1975-10-14 | 2015-06-22 |
   | Godwin  Ewang | male | 16 | 1998-12-09 | 2015-06-22 |
   | Ebiwumi Utondu | female | 31 | 1984-02-26 | 2015-06-22 |
   | Olatunji Rumfa | male | 51 | 1963-06-22 | 2015-06-22 |
   | Arome Kareem | male | 31 | 1983-06-18 | 2015-06-22 |
   | Bola Bozimo | female | 55 | 1959-12-11 | 2015-06-22 |
   |-----
 
   \medskip

:END:

** DONE Tasks to update

#+name: taskupdate
#+begin_src R :exports both :dir ../../doc.generation/mustache :results value org drawer :chache no :var iduser=usercode day=22
library(whisker)
cs <- read.csv2("../../data.out/ft_tasks.csv", sep=";", header=TRUE, skip=0, 
  na.strings=c("","nil"), stringsAsFactors=FALSE)
cs <- cs[order(cs$IdCase, cs$LastName), ]
cs <- cs[cs$TaskStatus=="done",]

cs <- cs[cs$IdUser==iduser,]
cs <- cs[cs$Day==day,]

task <- unname(rowSplit(cs))

f <- "task.org"
contents <- readChar(f, file.info(f)$size)

text <- whisker.render(contents)
text <- gsub("[\r]", "", text)
text
#+end_src

#+RESULTS: taskupdate
:RESULTS:

#+Attr_Latex: :center nil :booktabs t
   |--------------------------------------+---------+---------+-----------------+--------------+----------------|
   | Case                                 | Sex     | Age     | DoB             | Task         | Status         |
   |--------------------------------------+---------+---------+-----------------+--------------+----------------|
   |  Sesugh Ogunode | male | 17 | 1998-05-03 | burial | done |
   | Abieyuwa Nwakaeme | female | 32 | 1983-01-31 | burial | done |
   | Enweliku Sani | male | 43 | 1972-11-05 | isolation | done |
   | Godwin  Ewang | male | 16 | 1998-12-09 | isolation | done |
   | Adejoke Novia | female | 45 | 1970-03-24 | isolation | done |
   | Ikharo Idoko | male | 18 | 1996-09-17 | burial | done |
   | Iyokpesomi Oshikoya | female | 60 | 1954-10-07 | isolation | done |
   | Ikeoluwatomiwaopayemi Jibowu | female | 23 | 1992-07-04 | burial | done |
   | Bukola Ajibade | female | 58 | 1956-05-10 | isolation | done |
   | Olubowale Oyedepo | male | 36 | 1979-01-26 | isolation | done |
   | Iniobong Barka | female | 18 | 1996-07-17 | burial | done |
   | Ugoh Ayeni | male | 27 | 1987-11-20 | isolation | done |
   | Ugoh Ayeni | male | 27 | 1987-11-20 | burial | done |
   | Adeleke Ogundana | male | 31 | 1984-05-21 | isolation | done |
   |-----

   \medskip

:END:

